# src/institutes.py

# Словарь, где ключом является название института,
# а значением – список кафедр, принадлежащих к этому институту.
institutes_departments = {
    "Институт информационных технологий": [
        "Базовая кафедра № 231 – информационных процессов и систем",
        "Базовая кафедра № 232 – вычислительных систем реального времени",
        "Базовая кафедра № 234 – управляющих ЭВМ",
        "Базовая кафедра № 244 – информационных технологий в системах управления",
        "Базовая кафедра № 250 – математического обеспечения информационных систем",
        "Базовая кафедра № 256 – многосетевых информационных систем",
        "Кафедра вычислительной техники",
        "Кафедра игровой индустрии",
        "Кафедра инструментального и прикладного программного обеспечения",
        "Кафедра информационных технологий в атомной энергетике",
        "Кафедра корпоративных информационных систем",
        "Кафедра математического обеспечения и стандартизации информационных технологий",
        "Кафедра практической и прикладной информатики",
        "Кафедра прикладной математики",
        "Кафедра цифровой трансформации",
        "Кафедра информационных технологий обработки и анализа больших данных"
    ],
    "Институт искусственного интеллекта": [
        "Кафедра автоматических систем",
        "Кафедра биокибернетических систем и технологий",
        "Кафедра промышленной информатики",
        "Кафедра высшей математики",
        "Кафедра компьютерной и информационной безопасности",
        "Кафедра проблем управления",
        "Кафедра системной инженерии",
        "Кафедра технологий искусственного интеллекта",
        "Базовая кафедра № 235 - цифровых устройств и систем защиты информации",
        "Базовая кафедра № 252 - информационной безопасности",
        "Базовая кафедра № 254 - вычислительных комплексов",
        "Базовая кафедра № 530 - автоматики и управления",
        "Базовая кафедра № 536 - программного обеспечения систем радиоэлектронной аппаратуры",
        "Базовая кафедра № 539 - авиационно-космических систем обработки информации и управления"
    ]
    # Добавьте остальные институты при необходимости
}